garyPenhook/PyAvrOCD/svd/attiny104.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x0080000F</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register A</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC00</name>
              <description>Interrupt Sense Control 0 Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISC01</name>
              <description>Interrupt Sense Control 0 Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag register</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTF0</name>
              <description>External Interrupt Flag 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0</name>
              <description>External Interrupt Request 0 Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCICR</name>
          <description>Pin Change Interrupt Control Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIE0</name>
              <description>Pin Change Interrupt Enable 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIE1</name>
              <description>Pin Change Interrupt Enable 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIFR</name>
          <description>Pin Change Interrupt Flag Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF0</name>
              <description>Pin Change Interrupt Flag 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIF1</name>
              <description>Pin Change Interrupt Flag 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Mask Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT0</name>
              <description>Pin Change Enable Mask 0 Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT1</name>
              <description>Pin Change Enable Mask 0 Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT2</name>
              <description>Pin Change Enable Mask 0 Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT3</name>
              <description>Pin Change Enable Mask 0 Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT4</name>
              <description>Pin Change Enable Mask 0 Bit 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT5</name>
              <description>Pin Change Enable Mask 0 Bit 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT6</name>
              <description>Pin Change Enable Mask 0 Bit 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT7</name>
              <description>Pin Change Enable Mask 0 Bit 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Mask Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT8</name>
              <description>Pin Change Enable Mask 1 Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT9</name>
              <description>Pin Change Enable Mask 1 Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT10</name>
              <description>Pin Change Enable Mask 1 Bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCINT11</name>
              <description>Pin Change Enable Mask 1 Bit 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
